backend/modules/api/controllers/DefaultController.php

SELECT `USER_ACCOUNT`, `CP_CODE_ACCOUNT` FROM `dealers` WHERE (`STATUS`=1) AND (`DEALER_ID`='100015703')
---
    function findAcc($dealerId){
       return Dealers::find()->select(['USER_ACCOUNT','CP_CODE_ACCOUNT'])->where(['STATUS'=>1,'DEALER_ID'=>$dealerId])->one();

SELECT `ID`, `CODE`, `DEALER_ID` FROM `dealers` WHERE `DEALER_ID`='100015703'
---
	function findDealerByDealerId($dealerId){
		$res = Dealers::find()
		              ->select(['ID','CODE','DEALER_ID'])
		              ->where(['DEALER_ID'=>$dealerId])
		              ->one()