backend/modules/VnpSynchronizeSubcriberTransaction/controllers/DefaultController.php

    function findByRequestId($requestId,$tranId){
         $res = SubscriptRequest::find()
              ->select(['ID','REQUEST_ID','TRANSACTION_ID','DEALER_ID','DEALER_CODE'])
              ->where(['REQUEST_ID'=>$requestId,'TRANSACTION_ID'=>$tranId])
              ->one()
---
SELECT `ID`, `REQUEST_ID`, `TRANSACTION_ID`, `DEALER_ID`, `DEALER_CODE` FROM `subscript_request` WHERE (`REQUEST_ID`='5853060121') AND (`TRANSACTION_ID`='104737593')