backend/modules/users/controllers/DefaultController.php

                $page = $_GET['page'];
            }
            $offset = ($page-1)*$limit;
            $dataProviders = Accounts::find()
                            ->where(['<>','STATUS', 2])
                            ->select([
                                    'ACC_ID',
                                    'USERNAME',
                                    'CP_CODE',
                                    'STATUS',
                                    'PHONE',
                                    'EMAIL',
                                    'PARENT_ID',
                                    'CREATE_DATE',
                                ])
                            ->with([    // this is for the related models
                                'parent' => function($query) {
                                    $query->select(['ACC_ID','USERNAME']);
                                },
                            ])
                            ->limit($limit)
                            ->offset($offset)
                            ->orderBy(['ACC_ID'=>SORT_DESC])
                            ->asArray()
                            ->all();
---
SELECT `ACC_ID`, `USERNAME`, `CP_CODE`, `STATUS`, `PHONE`, `EMAIL`, `PARENT_ID`, `CREATE_DATE` FROM `accounts` WHERE `STATUS` <> 2 ORDER BY `ACC_ID` DESC LIMIT 100