backend/components/Acl.php

SELECT `MODULE_ID` FROM `modules` WHERE (`RESOURCE`='subscript') AND (`STATUS`=1)
SELECT `ALL_RIGHT`, `LIST_RIGHT`, `VIEW_RIGHT`, `ADD_RIGHT`, `EDIT_RIGHT`, `DEL_RIGHT`, `UP_RIGHT`, `DOWN_RIGHT` FROM `user_permission` WHERE (`ACC_ID`=1) AND (`MODULE_ID`='22') AND (`STATUS`=1)
---
    function getpermission(){
        $userID = 0;
        if (!Yii::$app->user->isGuest) {
            $userID     =  Yii::$app->user->identity->id;
        }
        $module = '';
        $module = Yii::$app->controller->module->id;
        $resultModule = Modules::find()
                                ->select(['MODULE_ID'])
                                ->asArray()
                                ->where(['RESOURCE' => $module,'STATUS'=>1])
                                ->one();
        $moduleId = 0 ;
        if(isset($resultModule) && $resultModule){
            $moduleId = $resultModule['MODULE_ID'];
        }else{
            //echo 'Module chưa được khai báo hoặc chưa được kích hoạt';
            //Huong xu lý;
            //chuyen huong ve trang chu;
        }

        $resultUserPermission = UserPermission::find()
                                    ->select(['ALL_RIGHT','LIST_RIGHT','VIEW_RIGHT','ADD_RIGHT','EDIT_RIGHT','DEL_RIGHT','UP_RIGHT','DOWN_RIGHT'])
                                    ->asArray()
                                    ->where(['ACC_ID' => $userID,'MODULE_ID'=>$moduleId,'STATUS'=>1])
                                    ->one();

SELECT `user_permission`.`ALL_RIGHT`, `user_permission`.`LIST_RIGHT`, `user_permission`.`VIEW_RIGHT`, `user_permission`.`ADD_RIGHT`, `user_permission`.`EDIT_RIGHT`, `user_permission`.`DEL_RIGHT`, `user_permission`.`UP_RIGHT`, `user_permission`.`DOWN_RIGHT`, `user_permission`.`MODULE_ID`, `m`.`RESOURCE` FROM `user_permission` LEFT JOIN `modules` `m` ON m.MODULE_ID=user_permission.MODULE_ID WHERE `user_permission`.`ACC_ID`=1
---
    function getAllPermissions(){
        $idUser = 0;
        if (!Yii::$app->user->isGuest) {
            $idUser     =  Yii::$app->user->identity->id;
        }
        $resultUserPermissions = UserPermission::find()
                                    ->select(['user_permission.ALL_RIGHT','user_permission.LIST_RIGHT','user_permission.VIEW_RIGHT','user_permission.ADD_RIGHT','user_permission.EDIT_RIGHT','user_permission.DEL_RIGHT','user_permission.UP_RIGHT','user_permission.DOWN_RIGHT','user_permission.MODULE_ID','m.RESOURCE'])
                                    ->asArray()
                                    ->leftJoin('modules m', 'm.MODULE_ID=user_permission.MODULE_ID')
                                    ->where(['user_permission.ACC_ID' => $idUser])
                                    ->all();