backend/components/Quick.php

    public static function findDealers(){
        $lvUserLogin =  Yii::$app->user->identity->LEVEL;
        $userLogin =  Yii::$app->user->identity->USERNAME;

        // ArrayHelper::multisort($data, [ 'age','name',], [SORT_ASC, SORT_ASC]);
        $dataProvidersModel = Dealers::find()
                                ->select(['ID','DEALER_ID','NAME'])
                                ->where(['=','STATUS',1])
                                // ->asArray()
                                ;
        if($lvUserLogin > 0){
            $dataProvidersModel->andWhere(['=','USER_ACCOUNT',$userLogin]);
        }
        $datas = $dataProvidersModel->all();
---
SELECT `ID`, `DEALER_ID`, `NAME` FROM `dealers` WHERE `STATUS` = 1

     public static function findProductOfServices($options = []){

        // ArrayHelper::multisort($data, [ 'age','name',], [SORT_ASC, SORT_ASC]);
        $model = Services::find()
                                ->select(['ID','ID_PACKAGE','PRODUCT_CODE'])
                                // ->where(['=','ID',10000])
                                // ->asArray()
                                ;
        if(isset($options['SERVICE_CODE']) && $options['SERVICE_CODE']){
            $model->where(['=','SERVICE_CODE',$options['SERVICE_CODE']]);
        }
        $data = $model->all();
---
SELECT `ID`, `ID_PACKAGE`, `PRODUCT_CODE` FROM `services` WHERE `SERVICE_CODE` = 'BANTINAMNHAC'

    public static function findByServices(){

        // ArrayHelper::multisort($data, [ 'age','name',], [SORT_ASC, SORT_ASC]);
        $model = Services::find()
                                ->select(['SERVICE_CODE'])
                                // ->where(['=','ID',10000])
                                // ->asArray()
                                ->groupBy(['SERVICE_CODE']);

        $data = $model->all();
---
SELECT `SERVICE_CODE` FROM `services` GROUP BY `SERVICE_CODE`